---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCAggregate.Count
source: html/8757ab42-2db4-5260-ff44-03b6fd5cbe57.htm
---
# Autodesk.Revit.DB.IFC.IFCAggregate.Count Property

The number of the data values in the aggregate.

## Syntax (C#)
```csharp
public int Count { get; }
```